# Data Manipulation

# import libraries

In [2]:
import numpy as np
import pandas as pd

# Creating Series

First Way

In [5]:
S1=pd.Series([10,20,30,40,50,60],index=["a","b","c","d","e","f"])
S1

a    10
b    20
c    30
d    40
e    50
f    60
dtype: int64

Second Way

In [6]:
S2=pd.Series({"p":10,"Q":20,"R":30})
S2

p    10
Q    20
R    30
dtype: int64

# Type

In [7]:
type(S1)

pandas.core.series.Series

In [8]:
S1[0]

10

In [11]:
S1["c"]

30

In [12]:
S2["Q"]

20

# Pandas Dataframes

# Creating df using dictionaries

In [15]:
data={"name":["a","b","c","d","e"],"age":[10,20,30,22,11],"marks":[64,76,85,90,100]}
df=pd.DataFrame(data,index=[1,2,3,4,5])
df

  name  age  marks
1    a   10     64
2    b   20     76
3    c   30     85
4    d   22     90
5    e   11    100

# Creating df using numpy arrays

In [20]:
arr=np.array([[10,20],[30,40],[50,60]])
arr

array([[10, 20],
       [30, 40],
       [50, 60]])

In [25]:
df=pd.DataFrame(arr,columns=["col01","col02"],index=[1,2,3])
df

   col01  col02
1     10     20
2     30     40
3     50     60

# Import data

CSV File

In [28]:
df=pd.read_csv("C:\\Users\\Dedshan Vimukthi\\Documents\\Datasets\\iris.CSV")
df

       Id  Sepal.Length  Sepal.Width  Petal.Length  Petal.Width    Species
0    1001           5.1          3.5           1.4          0.2     setosa
1    1002           4.9          3.0           1.4          0.2     setosa
2    1003           4.7          3.2           1.3          0.2     setosa
3    1004           4.6          3.1           1.5          0.2     setosa
4    1005           5.0          3.6           1.4          0.2     setosa
..    ...           ...          ...           ...          ...        ...
145  1146           6.7          3.0           5.2          2.3  virginica
146  1147           6.3          2.5           5.0          1.9  virginica
147  1148           6.5          3.0           5.2          2.0  virginica
148  1149           6.2          3.4           5.4          2.3  virginica
149  1150           5.9          3.0           5.1          1.8  virginica

[150 rows x 6 columns]

Excel file

In [32]:
df=pd.read_excel("C:\\Users\\Dedshan Vimukthi\\Documents\\Datasets\\iris.XLSX")
df

     Sepal.Length  Sepal.Width  Petal.Length  Petal.Width    Species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

# head function

In [47]:
df.head()

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [48]:
df.head(20)

    Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0            5.1          3.5           1.4          0.2  setosa
1            4.9          3.0           1.4          0.2  setosa
2            4.7          3.2           1.3          0.2  setosa
3            4.6          3.1           1.5          0.2  setosa
4            5.0          3.6           1.4          0.2  setosa
5            5.4          3.9           1.7          0.4  setosa
6            4.6          3.4           1.4          0.3  setosa
7            5.0          3.4           1.5          0.2  setosa
8            4.4          2.9           1.4          0.2  setosa
9            4.9          3.1           1.5          0.1  setosa
10           5.4          3.7           1.5          0.2  setosa
11           4.8          3.4           1.6          0.2  setosa
12           4.8          3.0           1.4          0.1  setosa
13           4.3          3.0           1.1          0.1  setosa
14           5.8          4.0           1.2          0.2  setosa
15           5.7          4.4           1.5          0.4  setosa
16           5.4          3.9           1.3          0.4  setosa
17           5.1          3.5           1.4          0.3  setosa
18           5.7          3.8           1.7          0.3  setosa
19           5.1          3.8           1.5          0.3  setosa

# tail function

In [49]:
df.tail()

     Sepal.Length  Sepal.Width  Petal.Length  Petal.Width    Species
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

In [50]:
df.tail(10)

     Sepal.Length  Sepal.Width  Petal.Length  Petal.Width    Species
140           6.7          3.1           5.6          2.4  virginica
141           6.9          3.1           5.1          2.3  virginica
142           5.8          2.7           5.1          1.9  virginica
143           6.8          3.2           5.9          2.3  virginica
144           6.7          3.3           5.7          2.5  virginica
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

# Columns and indexes of the df

In [33]:
df.columns

Index(['Sepal.Length', 'Sepal.Width', 'Petal.Length', 'Petal.Width',
       'Species'],
      dtype='object')

In [35]:
list(df.index)

[0,
 1,
 2,
 3,
 4,
 5,
 6,
 7,
 8,
 9,
 10,
 11,
 12,
 13,
 14,
 15,
 16,
 17,
 18,
 19,
 20,
 21,
 22,
 23,
 24,
 25,
 26,
 27,
 28,
 29,
 30,
 31,
 32,
 33,
 34,
 35,
 36,
 37,
 38,
 39,
 40,
 41,
 42,
 43,
 44,
 45,
 46,
 47,
 48,
 49,
 50,
 51,
 52,
 53,
 54,
 55,
 56,
 57,
 58,
 59,
 60,
 61,
 62,
 63,
 64,
 65,
 66,
 67,
 68,
 69,
 70,
 71,
 72,
 73,
 74,
 75,
 76,
 77,
 78,
 79,
 80,
 81,
 82,
 83,
 84,
 85,
 86,
 87,
 88,
 89,
 90,
 91,
 92,
 93,
 94,
 95,
 96,
 97,
 98,
 99,
 100,
 101,
 102,
 103,
 104,
 105,
 106,
 107,
 108,
 109,
 110,
 111,
 112,
 113,
 114,
 115,
 116,
 117,
 118,
 119,
 120,
 121,
 122,
 123,
 124,
 125,
 126,
 127,
 128,
 129,
 130,
 131,
 132,
 133,
 134,
 135,
 136,
 137,
 138,
 139,
 140,
 141,
 142,
 143,
 144,
 145,
 146,
 147,
 148,
 149]

# shape function

In [36]:
df.shape

(150, 5)

In [37]:
df.shape[0]

150

import excel files for getting excel sheets in entire file

ef=pd.ExcelFile("C:\\Users\\Dedshan Vimukthi\\Documents\\Datasets\\iris.XLSX")
ef

In [39]:
ef.sheet_names

['iris', 'marks']

In [40]:
ef.sheet_names[0]

'iris'

In [44]:
ef1=ef.parse("iris")
ef1.head()

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [46]:
ef2=ef.parse("marks")
ef2

   ID  Marks
0   1     67
1   2     78
2   3     76
3   4     66
4   5     89

# Adding new column

In [55]:
data={"col1":[10,20,30,40,50],"col2":np.random.randint(1,20,5),"col3":[11,2,34,25,4]}
df=pd.DataFrame(data)
df

   col1  col2  col3
0    10    16    11
1    20    19     2
2    30     9    34
3    40     9    25
4    50    12     4

In [56]:
df["col4"]=[11,22,33,44,55]

In [57]:
df

   col1  col2  col3  col4
0    10    16    11    11
1    20    19     2    22
2    30     9    34    33
3    40     9    25    44
4    50    12     4    55

# Accessing Columns

In [58]:
df["col1"]

0    10
1    20
2    30
3    40
4    50
Name: col1, dtype: int64

In [59]:
df[["col2","col3"]]

   col2  col3
0    16    11
1    19     2
2     9    34
3     9    25
4    12     4

# Accessing Elements

In [60]:
data={"col1":[10,20,30,40,50],"col2":np.random.randint(1,20,5),"col3":[11,2,34,25,4]}
df=pd.DataFrame(data)
df

   col1  col2  col3
0    10    19    11
1    20     8     2
2    30    10    34
3    40    16    25
4    50    16     4

In [61]:
df["col2"][1]

8

In [63]:
df.iloc[1,2]

2

In [64]:
df.iloc[1:4,1:]

   col2  col3
1     8     2
2    10    34
3    16    25

In [65]:
df.iat[3,0]

40

In [68]:
df.at[1,"col2"]

8

# Pandas df opperations

In [70]:
data={"name":["a","b","c","d","e","f"],"marks1":[35,86,90,100,46,54],"marks2":[65,76,88,34,90,66]}
df=pd.DataFrame(data)
df

  name  marks1  marks2
0    a      35      65
1    b      86      76
2    c      90      88
3    d     100      34
4    e      46      90
5    f      54      66

In [72]:
df["total_marks"]=df["marks1"]+df["marks2"]
df

  name  marks1  marks2  total_marks
0    a      35      65          100
1    b      86      76          162
2    c      90      88          178
3    d     100      34          134
4    e      46      90          136
5    f      54      66          120

In [76]:
df["result1"]=["A" if m>=75 else "B" if m>=65 else "C" if m>=55 else "D" if m>=35 else "F" for m in df["marks1"]]
df

  name  marks1  marks2  total_marks result result1
0    a      35      65          100      D       D
1    b      86      76          162      A       A
2    c      90      88          178      A       A
3    d     100      34          134      A       A
4    e      46      90          136      D       D
5    f      54      66          120      D       D

In [83]:
df["result2"]=["A" if m>=75 else "B" if m>=65 else "C" if m>=55 else "D" if m>=35 else "F" for m in df["marks2"]]
df

  name  marks1  marks2  total_marks result1 result2
0    a      35      65          100       D       B
1    b      86      76          162       A       A
2    c      90      88          178       A       A
3    d     100      34          134       A       F
4    e      46      90          136       D       A
5    f      54      66          120       D       B

In [84]:
df["marks2"]=["A" if m>=75 else "B" if m>=65 else "C" if m>=55 else "D" if m>=35 else "F" for m in df["marks2"]]
df

  name  marks1 marks2  total_marks result1 result2
0    a      35      B          100       D       B
1    b      86      A          162       A       A
2    c      90      A          178       A       A
3    d     100      F          134       A       F
4    e      46      A          136       D       A
5    f      54      B          120       D       B

In [85]:
data={"name":["a","b","c","d","e","f"],"marks1":[35,86,90,100,46,54],"marks2":[65,76,88,34,90,66]}
df=pd.DataFrame(data)
df

  name  marks1  marks2
0    a      35      65
1    b      86      76
2    c      90      88
3    d     100      34
4    e      46      90
5    f      54      66

In [86]:
df.apply(sum)

TypeError: unsupported operand type(s) for +: 'int' and 'str'

In [87]:
data={"marks1":[35,86,90,100,46,54],"marks2":[65,76,88,34,90,66]}
df=pd.DataFrame(data)
df

   marks1  marks2
0      35      65
1      86      76
2      90      88
3     100      34
4      46      90
5      54      66

In [88]:
df.apply(sum)

marks1    411
marks2    419
dtype: int64

In [89]:
df.apply(sum,axis=1)

0    100
1    162
2    178
3    134
4    136
5    120
dtype: int64

In [90]:
df.apply(sum,axis=0)

marks1    411
marks2    419
dtype: int64

In [91]:
df.apply(len)

marks1    6
marks2    6
dtype: int64

In [92]:
df.apply(len,axis=1)

0    2
1    2
2    2
3    2
4    2
5    2
dtype: int64

In [93]:
fun=lambda x:2*x

In [94]:
df.apply(fun)

   marks1  marks2
0      70     130
1     172     152
2     180     176
3     200      68
4      92     180
5     108     132

In [95]:
df.apply(fun,axis=1)

   marks1  marks2
0      70     130
1     172     152
2     180     176
3     200      68
4      92     180
5     108     132

In [96]:
data={"marks1":[35,86,90,100,46,54],"marks2":[65,76,88,34,90,66]}
df=pd.DataFrame(data)
df

   marks1  marks2
0      35      65
1      86      76
2      90      88
3     100      34
4      46      90
5      54      66

In [97]:
df["marks1"].map(fun)

0     70
1    172
2    180
3    200
4     92
5    108
Name: marks1, dtype: int64

In [104]:
data={"marks1":[35,86,90,100,46,54],"marks2":[65,76,88,34,90,66]}
df=pd.DataFrame(data)
df

   marks1  marks2
0      35      65
1      86      76
2      90      88
3     100      34
4      46      90
5      54      66

In [105]:
df["marks2"].map(lambda x:5*x)

0    325
1    380
2    440
3    170
4    450
5    330
Name: marks2, dtype: int64

In [106]:
data={"marks1":[35,86,90,100,46,54],"marks2":[65,76,88,34,90,66]}
df=pd.DataFrame(data)
df

   marks1  marks2
0      35      65
1      86      76
2      90      88
3     100      34
4      46      90
5      54      66

In [107]:
fun=lambda L:["p" if m>50 else "f" for m in L]

In [108]:
df.apply(fun)

  marks1 marks2
0      f      p
1      p      p
2      p      p
3      p      f
4      f      p
5      p      p